[
    {
        "company": "Santos Roofing & Construction",
        "image": "images/santos-logo.png",
        "alt": "Santos Roofing & Construction team at work",
        "description": "Santos Roofing & Construction is a locally owned business in Cedar City specializing in residential and commercial roofing, siding, and home improvement. They focus on quality workmanship, durability, and customer satisfaction. Their team provides personalized service and free estimates for every project.",
        "specialty": "Residential and commercial roofing, construction, remodeling"
    },
    {
        "company": "Tacos Bravo",
        "image": "images/tacos-logo.jpg",
        "alt": "Tacos Bravo",
        "description": "Tacos Bravo is a popular Mexican food truck in Cedar City serving fresh, authentic tacos and other favorites. Known for their friendly service and vibrant flavors, they are a local hit at events, festivals, and community gatherings.",
        "specialty": "Authentic Mexican cuisine, catering, and family-friendly dining"
    },
    {
        "company": "Funtime Inflatables",
        "image": "https://picsum.photos/150/150?random=10",
        "alt": "Funtime Inflatables",
        "description": "Funtime Inflatables brings fun and excitement to parties and events with safe, high-quality inflatable rentals for kids and families. Their friendly team ensures hassle-free setup, so every event is memorable and full of smiles.",
        "specialty": "Bounce houses, obstacle courses, slides, interactive games, party rentals."
    },
    {
        "company": "Second East",
        "image": "https://picsum.photos/150/150?random=8",
        "alt": "Second East",
        "description": "Second East is a cozy Cedar City eatery serving fresh, homemade meals with a focus on breakfast and lunch favorites. They are known for friendly service and a warm, inviting atmosphere.",
        "specialty": "Breakfast & brunch, baked goods, local flavors, catering."
    },
        {
        "company": "Market Grill",
        "image": "https://picsum.photos/150/150?random=9",
        "alt": "Market Grill",
        "description": "Market Grill offers classic American comfort food in a family-friendly enviornment. Their menu features hearty dishes made with locally sourced ingredients.",
        "specialty": "Country-style cooking, breakfast dishes, homemade desserts."
    }
]